
## :white_check_mark: Apply Succeeded (account-delete-monitor-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/16501)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.eventtracker_lambda_lambda-default-file_1211ABBC: Reading...
data.archive_file.eventtracker_lambda_lambda-default-file_1211ABBC: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.aws_caller_identity.caller: Reading...
data.aws_iam_policy_document.eventtracker_lambda-code-deploy_code-deploy-assume-role-policy-document_B18805A8: Reading...
aws_s3_bucket.eventtracker_lambda_code-bucket_E2F7C311: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker]
data.aws_iam_policy_document.eventtracker_lambda_assume-policy-document_F8F8B6BD: Reading...
data.aws_ssm_parameter.eventtracker_service-hash_907E4970: Reading...
aws_sqs_queue.eventtracker_lambda_sqs_queue_redrive_sqs_queue_D13D2A55: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue-Deadletter]
data.aws_iam_policy_document.eventtracker_lambda-code-deploy_code-deploy-assume-role-policy-document_B18805A8: Read complete after 1s [id=4250039221]
data.aws_iam_policy_document.eventtracker_lambda_assume-policy-document_F8F8B6BD: Read complete after 1s [id=1349007126]
aws_dynamodb_table.event-table_dynamodb_table_49BD839C: Refreshing state... [id=ADM-Dev-event-table]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_ssm_parameter.eventtracker_sentry-dsn_D349DC66: Reading...
data.aws_caller_identity.caller: Read complete after 1s [id=410318598490]
data.aws_region.region: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_sqs_queue.sns-topic-dql: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_ssm_parameter.eventtracker_service-hash_907E4970: Read complete after 1s [id=/AccountDeleteMonitor/CircleCI/Dev/SERVICE_HASH]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
aws_codedeploy_app.eventtracker_lambda-code-deploy_code-deploy-app_B68BD6E0: Refreshing state... [id=e59de1dc-335d-4b1f-aacf-8d3cfb61118a:AccountDeleteMonitor-Dev-EventTracker-Lambda]
data.aws_ssm_parameter.eventtracker_sentry-dsn_D349DC66: Read complete after 0s [id=/AccountDeleteMonitor/Dev/SENTRY_DSN]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.eventtracker_lambda_execution-policy-document_F9298495: Reading...
data.aws_iam_policy_document.eventtracker_lambda_execution-policy-document_F9298495: Read complete after 0s [id=2591764522]
aws_iam_role.eventtracker_lambda-code-deploy_code-deploy-role_761181E3: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_sqs_queue.eventtracker_lambda_sqs_queue_3DFE90FE: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_iam_role.eventtracker_lambda_execution-role_6AC27719: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole]
data.aws_iam_policy_document.adm-sns-dlq-policy-document: Reading...
data.aws_iam_policy_document.adm-sns-dlq-policy-document: Read complete after 0s [id=3057489341]
aws_iam_policy.eventtracker_lambda_execution-policy_A74ACAF0: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-ExecutionRolePolicy]
data.aws_iam_policy_document.EventTracker-lambda-dynamo-policy-doc: Reading...
data.aws_iam_policy_document.EventTracker-lambda-dynamo-policy-doc: Read complete after 0s [id=943073984]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
aws_sqs_queue_policy.adm-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-SNS-Topics-DLQ]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P2U74EH]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PLQT521]
aws_sns_topic_subscription.UserMerge-Topic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserMerge-Topic:d5ce198f-fc64-49da-8862-641c33a69c97]
data.aws_iam_policy_document.adm-sns-sqs-policy-document: Reading...
data.aws_iam_policy_document.adm-sns-sqs-policy-document: Read complete after 0s [id=1952077213]
data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47: Reading...
data.aws_iam_policy_document.eventtracker_lambda_sqs_policy_DEBDCD47: Read complete after 0s [id=124770717]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:29c9c40c-d967-4e6f-b940-c0e6c41ac7f1]
aws_sqs_queue_policy.adm-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDeleteMonitor-Dev-EventTracker-Queue]
aws_s3_bucket_ownership_controls.eventtracker_lambda_code-bucket-ownership-controls_AC55EF91: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker]
aws_s3_bucket_public_access_block.eventtracker_lambda_code-bucket-public-access-block_5C535663: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker]
aws_iam_role_policy_attachment.eventtracker_lambda-code-deploy_code-deploy-policy-attachment_41A74CFD: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-CodeDeployRole-20220809154045381900000001]
aws_codedeploy_deployment_group.eventtracker_lambda-code-deploy_code-deployment-group_C430DA66: Refreshing state... [id=e2856008-16c3-4bd8-96e3-6e2dfefd0311]
aws_iam_policy.eventtracker_sqs-policy_32E8FFAA: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDeleteMonitor-Dev-EventTracker-LambdaSQSPolicy]
aws_iam_role_policy_attachment.eventtracker_lambda_execution-role-policy-attachment_4A84019A: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154045504800000002]
aws_iam_policy.EventTracker-lambda-dynamo-policy: Refreshing state... [id=arn:aws:iam::410318598490:policy/account-delete-monitor-EventTracker-DynamoLambdaPolicy]
aws_s3_bucket_acl.eventtracker_lambda_code-bucket-acl_94F01E32: Refreshing state... [id=pocket-accountdeletemonitor-dev-eventtracker,private]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
aws_iam_role_policy_attachment.eventtracker_execution-role-policy-attachment_88191D7C: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154135337800000004]
aws_iam_role_policy_attachment.EventTracker-execution-role-policy-attachment: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-ExecutionRole-20220809154100125700000003]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-012481e83ffa5e152]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PWVAAC0]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=PSJPZMA]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PPN1ZNN]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P8ADYXK]
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 0s [id=us-east-1]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 0s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 0s [id=us-east-1]
aws_lambda_function.eventtracker_lambda_2D56166D: Refreshing state... [id=AccountDeleteMonitor-Dev-EventTracker-Function]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Non-Critical:766cdcf7-dd3a-416c-bba7-6226514d882f]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242]
aws_lambda_alias.eventtracker_lambda_alias_63DC690A: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:AccountDeleteMonitor-Dev-EventTracker-Function:DEPLOYED]
aws_cloudwatch_log_group.eventtracker_lambda_log-group_D52B53E0: Refreshing state... [id=/aws/lambda/AccountDeleteMonitor-Dev-EventTracker-Function]
aws_lambda_event_source_mapping.eventtracker_lambda_event_source_mapping_9B8B4F28: Refreshing state... [id=514cb78e-d5a5-4410-b03f-0e870cdd3104]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84 is tainted, so must be replaced
-/+ resource "aws_sns_topic_subscription" "pagerduty_alarm-critical-subscription_E2168B84" {
      ~ arn                             = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242" -> (known after apply)
      ~ confirmation_was_authenticated  = false -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242" -> (known after apply)
      ~ owner_id                        = "410318598490" -> (known after apply)
      ~ pending_confirmation            = true -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creation complete after 1s [id=arn:aws:sns:us-east-1:410318598490:AccountDeleteMonitor-Dev-Infrastructure-Alarm-Critical:235bbd49-80b1-42e2-987d-f176ddc97242]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1144, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1144:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 5 more similar warnings elsewhere)
╵

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"0e86f9bb-16db-4a6f-8a81-464c90d7c792","JobName":"account-delete-monitor_infrastructure_apply_dev","PRNumber":82,"Program":"tfcmt","SHA1":"87e8c50841e4d9f41f1dda17a268527ac74ddd49","Target":"account-delete-monitor-cdk-dev","Vars":{}} -->